import { createContext, useContext, useEffect, useState } from "react";

const Clothing = [
  {
    type: "Childish",
    name: "ست بلوز شلوار پسرانه طرح جرثقیل",
    Price: "750000",
    Description:
      "ست بلوز و شلوار پسرانه با طرح جرثقیل کارتونی، دوخته‌شده از پارچه نخ پنبه با کیفیت، مناسب فصل‌های سرد سال. طراحی شاد و کودکانه، مناسب استفاده روزمره و بازی در خانه یا بیرون. عرضه‌شده توسط برند سارینا، مناسب کودکان ۳ ماه تا ۴ سال.",
    img: "Childish1.jpg",
    Quantity: 0,
    id: 4832,
  },
  {
    type: "Childish",
    name: "تیشرت راه راه دخترانه",
    Price: "390000",
    Description:
      "تیشرت راه راه دخترانه با طراحی شاد و بندهای روی شانه، انتخابی راحت و زیبا برای استفاده روزمره و تابستانی است.",
    img: "Childish2.jpg",
    Quantity: 0,
    id: 9174,
  },
  {
    type: "Childish",
    name: "تیشرت چاپی دخترانه",
    Price: "190000",
    Description:
      "تیشرت چاپی دخترانه با طراحی پیکسلی خاص و پاپیون فانتزی، مناسب پاییز و زمستان، انتخابی زیبا و گرم برای دختران خوش‌سلیقه است.",
    img: "Childish3.jpg",
    Quantity: 0,
    id: 2365,
  },
  {
    type: "Childish",
    name: "تیشرت چاپی پسرانه",
    Price: "210000",
    Description:
      "تیشرت چاپی پسرانه با طرح جذاب SAFARI، مناسب استایل روزمره و بازی‌های کودکانه.",
    img: "Childish4.jpg",
    Quantity: 0,
    id: 8401,
  },
  {
    type: "Childish",
    name: "مایو بچه گانه دخترانه با کلاه طرح پری دریایی سرخابی",
    Price: "1280000",
    Description: [
      "سایزبندی: مناسب 2 تا 9 سال",
      "کلاه: دارای کلاه",
      "ضد کلر: 100% ضد کلر",
      "جنس: جنس 85٪ پلی استر، 15٪ اسپندکس",
      "مدل: بدون آستین",
    ],

    img: "Childish5.jpg",
    Quantity: 0,
    id: 3617,
  },
  {
    type: "Childish",
    name: "ست کت سارافون نوزادی دخترانه طرح یونیکورن",
    Price: "750000",
    Description: [
      "دو تکه کت و سارافون زیردکمه دار",
      "سایزبندی: مناسب سایز 3 تا 24 ماه",
      "جنس محصول: نخی ضد حساسیت لطیف درجه یک",
    ],
    img: "Childish6.jpg",
    Quantity: 0,
    id: 5813,
  },
  {
    type: "Feminine",
    name: "شلوار زنانه پپا",
    Price: "340000",
    Description: [
      "طرح: ساده",
      "قواره: متناسب",
      "قد: زیر مچ پا",
      "جنس پارچه: دورس",
      "نرمی: نرم و لطیف",
      "ضخامت: ضخیم و مقاوم",
      "مناسب فصل: چهار فصل",
      "مورد استفاده: اسپرت، روزمره",
      "ساخت: ایران",
    ],
    img: "Feminine1.jpg",
    Quantity: 0,
    id: 7902,
  },
  {
    type: "Feminine",
    name: "دامن کوتاه زنانه ناکیا",
    Price: "210000",
    Description:
      "دامن کوتاه زنانه ناکیا با طراحی زیپی و جنس چرم مصنوعی، گزینه‌ای شیک و مدرن برای استایل‌های جسورانه و مهمانی‌های خاص است.",
    img: "Feminine2.jpg",
    Quantity: 0,
    id: 1347,
  },
  {
    type: "Feminine",
    name: "دامن بلند زنانه",
    Price: "260000",
    Description:
      "دامن بلند زنانه با طراحی خاص، پارچه سبک و رنگ خنثی، انتخابی شیک و راحت برای استایل روزمره یا نیمه‌رسمی در فصول گرم سال است.",
    img: "Feminine3.jpg",
    Quantity: 0,
    id: 9265,
  },
  {
    type: "Feminine",
    name: "تیشرت زنانه آستین بلند پانیل",
    Price: "262000",
    Description: [
      "جنس پارچه : نخی",
      "مدل یقه : هفت",
      "تهیه شده : از 100 درصد نخ پنبه",
      "آستین : بلند",
      "رنگ بندی : سرمه ای ، مشکی ، سفید ، سبز ، ارتشی ، قرمز ، فیروزه ای",
      "نرمی و زبری : نرم",
    ],
    img: "Feminine4.jpg",
    Quantity: 0,
    id: 1398,
  },
  {
    type: "Feminine",
    name: "شومیز چاپی زنانه",
    Price: "690000",
    Description:
      "شومیز چاپی زنانه با طرح برگ‌دار، یقه هفت و کش در پایین لباس، مناسب استایل‌های روزمره و بهاری. پارچه سبک و خنک، ایده‌آل برای استفاده در روزهای گرم سال.",
    img: "Feminine5.jpg",
    Quantity: 0,
    id: 7581,
  },
  {
    type: "Feminine",
    name: "شلوارک دخترانه دانیکا",
    Price: "780000",
    Description:
      "شلوارک دخترانه دانیکا با طراحی کمر چین‌دار، رنگ کرمی جذاب و پارچه‌ای خنک، گزینه‌ای شیک و راحت برای استایل تابستانی دختران است.",
    img: "Feminine6.jpg",
    Quantity: 0,
    id: 6830,
  },
  {
    type: "Feminine",
    name: "شلوارک چاپی دخترانه",
    Price: "480000",
    Description:
      "شلوارک چاپی دخترانه با طرح خال‌خالی، کمر کشی و پارچه خنک، انتخابی شیک و راحت برای روزهای گرم و بازی‌های کودکانه است.",
    Quantity: 0,
    id: 4519,
  },
  {
    type: "Feminine",
    name: "شلوارک جودون دخترانه",
    Price: "980000",
    Description:
      "شلوارک جودون دخترانه با طراحی ساده، پارچه باکیفیت و رنگ جذاب صورتی، گزینه‌ای راحت و شیک برای روزهای گرم سال است.",
    img: "Feminine9.jpg",
    Quantity: 0,
    id: 2071,
  },
  {
    type: "Feminine",
    name: "شومیز کوتاه زنانه بلمو",
    Price: "850000",
    Description:
      "شومیز کوتاه زنانه بلمو با طراحی آزاد، رنگ هلویی جذاب و آستین سه‌ربع، انتخابی شیک و راحت برای استایل‌های روزمره و نیمه‌رسمی است",
    img: "Feminine9.jpg",
    Quantity: 0,
    id: 3982,
  },
  {
    type: "Feminine",
    name: "شومیز زنانه جولیان",
    Price: "490000",
    Description:
      "بلوز زنانه یقه ایستاده مشکی، با جنس پنبه‌ای نرم و ضخامت متوسط، گزینه‌ای شیک و راحت برای فصول سرد سال است. مناسب استفاده روزمره، اسپرت و مهمانی. تولید ایران.",
    Quantity: 0,
    id: 6209,
  },
  {
    type: "Feminine",
    name: "شومیز زنانه جوتی جینز",
    Price: "899000",
    Description: [
      "جنس الیاف: 100% نخ پنبه",
      "نرمی و زبری: نرم",
      "ضخامت پارچه: کم",
    ],
    img: "Feminine11.jpg",
    Quantity: 0,
    id: 1875,
  },
  {
    type: "Feminine",
    name: "شومیز چهارخانه زنانه",
    Price: "430000",
    Description:
      "شومیز چهارخانه زنانه با طرح کلاسیک، یقه‌دار و آستین بلند، مناسب استفاده روزمره، کاری و دوستانه. جنس نرم و راحت، مناسب بهار و پاییز. دارای جیب روی سینه و طراحی شیک قابل ست با انواع شلوار و دامن.",
    img: "Feminine12.jpg",
    Quantity: 0,
    id: 9046,
  },
  {
    type: "Masculine",
    name: "تیشرت اور هوگرو مردانه",
    Price: "225000",
    Description:
      "تیشرت اورسایز مردانه از برند هوگرو، راحت، شیک و مناسب استایل روزمره.",
    img: "Masculine1.jpg",
    Quantity: 0,
    id: 2459,
  },
  {
    type: "Masculine",
    name: "پیراهن شانلی رنگ طوسی",
    Price: "495000",
    Description: [
      "جنس: پارچه باکیفیت و سبک",
      "طراحی: یقه کلاسیک، دوخت دقیق",
      "رنگ: طوسی، مناسب ست با استایل‌های مختلف",
      "اندازه: فیت استاندارد بدن",
      "کاربرد: مناسب برای محیط‌های رسمی و نیمه‌رسمی",
      "ویژگی خاص: تنفس‌پذیر و راحت برای استفاده در تمام فصول",
    ],
    img: "Masculine2.jpg",
    Quantity: 0,
    id: 3690,
  },
  {
    type: "Masculine",
    name: "پیراهن اسپرت مردانه",
    Price: "770000",
    Description:
      "پیراهن اسپرت مردانه با طراحی ساده و کلاسیک، مناسب استفاده روزمره و استایل‌های نیمه‌رسمی. تهیه‌شده از پارچه با کیفیت و راحت برای استفاده طولانی‌مدت.",
    img: "Masculine3.jpg",
    Quantity: 0,
    id: 8427,
  },
  {
    type: "Masculine",
    name: "پیراهن آستین کوتاه",
    Price: "460000",
    Description:
      "پیراهن آستین کوتاه مردانه با طرح چهارخانه کلاسیک، مناسب برای روزهای گرم و استایل‌های روزمره و نیمه‌رسمی. سبک، خنک و خوش‌دوخت.",
    img: "Masculine4.jpg",
    Quantity: 0,
    id: 1176,
  },
  {
    type: "Masculine",
    name: "شلوارجین بگ مردانه مشکی طوسی",
    Price: "780000",
    Description:
      "شلوار بگ کد 2047 با دوخت باکیفیت و پارچه‌ای مرغوب، انتخابی مناسب برای استایل روزمره و رسمی است. ظاهر جذاب، فرم‌دهی عالی به پاها و مقاومت بالا در برابر شست‌وشو و استفاده مداوم، این شلوار را به گزینه‌ای کاربردی برای تمام فصول تبدیل کرده است. موجود در سایزهای 31 تا 36.",
    img: "Masculine5.jpg",
    Quantity: 0,
    id: 5348,
  },
  {
    type: "Masculine",
    name: "شلوار مردانه لینن کمربند دار",
    Price: "560000",
    Description:
      "شلوار مردانه لینن کمربند دار با طراحی راسته، پارچه خنک و رنگ کلاسیک، گزینه‌ای شیک و راحت برای استایل رسمی و نیمه‌رسمی تابستانی است.",
    img: "Masculine6.jpg",
    Quantity: 0,
    id: 7024,
  },
  {
    type: "Masculine",
    name: "شلوار مردانه اسلش سرمه ای",
    Price: "560000",
    Description:
      "شلوار مردانه اسلش سرمه‌ای با طراحی راحت، کمر کشی و دمپای کش‌بافت، گزینه‌ای عالی برای استایل اسپرت و استفاده روزمره است.",
    img: "Masculine7.jpg",
    Quantity: 0,
    id: 1698,
  },
  {
    type: "Masculine",
    name: "تیشرت طرح دار",
    Price: "850000",
    Description:
      "تی‌شرت طرح‌دار مردانه سارینا با تنوع طرح و رنگ، کیفیت دوخت بالا و پارچه نخ‌پنبه ضد حساسیت، انتخابی عالی برای استایل روزمره و حتی رسمی است. این تیشرت‌ها گرم، نرم، مقاوم در برابر کشش و مناسب استفاده در تمام فصول هستند. در رنگ‌های مشکی، سفید، طوسی و آبی و سایزهای مختلف ارائه می‌شوند.",
    img: "Masculine8.jpg",
    Quantity: 0,
    id: 3952,
  },
];
const Contexts = createContext();
function StatesProvider({ children }) {
  const [clothingData, setClothingData] = useState(Clothing);
  const [show, setShow] = useState(false);
  const [showWindow, setShowWindow] = useState(false);

  return (
    <Contexts.Provider
      value={{ clothingData, show, setShow, showWindow, setShowWindow }}
    >
      {children}
    </Contexts.Provider>
  );
}

function useStates() {
  const context = useContext(Contexts);
  return context;
}

export { StatesProvider, useStates };
